# <center> Filling Missing values

In [1]:
import pandas as pd
import numpy as np
import warnings 
warnings.filterwarnings('ignore')

In [3]:
data=pd.read_excel('./fill_na.xlsx')
data.head(10)

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07          NaN        NaN     NaN
2 2020-05-08      30.9343        NaN   rainy
3 2020-05-09          NaN   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

## filling a common value to all missing value

In [4]:
data.fillna(0)

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07       0.0000   0.000000       0
2 2020-05-08      30.9343   0.000000   rainy
3 2020-05-09       0.0000   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382   0.000000   sunny

## adding missing data to individual column

In [8]:
data.fillna({
    'temperature':32.53,
    'windSpeed': 12.3,
    'status':'cloudy'
})

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      32.5300  12.300000  cloudy
2 2020-05-08      30.9343  12.300000   rainy
3 2020-05-09      32.5300   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  12.300000   sunny

## accessing individual columns

In [9]:
data.status.fillna('rainy')

0     sunny
1     rainy
2     rainy
3    cloudy
4     rainy
5     sunny
Name: status, dtype: object

In [10]:
data.temperature.fillna(35)

0    35.6582
1    35.0000
2    30.9343
3    35.0000
4    13.9082
5    23.9382
Name: temperature, dtype: float64

## row wise and column wise fill

## row wise
## forward fill

In [11]:
data.fillna(method='ffill')

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      35.6582  10.788378   sunny
2 2020-05-08      30.9343  10.788378   rainy
3 2020-05-09      30.9343   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  19.012990   sunny

## backward fill

In [13]:
data.fillna(method='bfill')

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      30.9343   6.889682   rainy
2 2020-05-08      30.9343   6.889682   rainy
3 2020-05-09      13.9082   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

## column wise

In [14]:
data.fillna(method='ffill',axis=1)

        date          temperature            windSpeed               status
0 2020-05-06              35.6582            10.788378                sunny
1 2020-05-07  2020-05-07 00:00:00  2020-05-07 00:00:00  2020-05-07 00:00:00
2 2020-05-08              30.9343              30.9343                rainy
3 2020-05-09  2020-05-09 00:00:00             6.889682               cloudy
4 2020-05-10              13.9082             19.01299                rainy
5 2020-05-11              23.9382              23.9382                sunny

In [16]:
data.fillna(method='bfill',axis=1)

        date temperature  windSpeed  status
0 2020-05-06     35.6582  10.788378   sunny
1 2020-05-07         NaT        NaT     NaT
2 2020-05-08     30.9343      rainy   rainy
3 2020-05-09    6.889682   6.889682  cloudy
4 2020-05-10     13.9082   19.01299   rainy
5 2020-05-11     23.9382      sunny   sunny

## limiting the forward fill and backward fill

In [17]:
data.fillna(method='ffill',limit=1)

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      35.6582  10.788378   sunny
2 2020-05-08      30.9343        NaN   rainy
3 2020-05-09      30.9343   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382  19.012990   sunny

In [18]:
data.fillna(method='bfill',limit=1)

        date  temperature  windSpeed  status
0 2020-05-06      35.6582  10.788378   sunny
1 2020-05-07      30.9343        NaN   rainy
2 2020-05-08      30.9343   6.889682   rainy
3 2020-05-09      13.9082   6.889682  cloudy
4 2020-05-10      13.9082  19.012990   rainy
5 2020-05-11      23.9382        NaN   sunny

## filling with pandas object

## by mean

In [19]:
data.fillna(data.mean())

        date  temperature  windSpeed  status
0 2020-05-06    35.658200  10.788378   sunny
1 2020-05-07    26.109725  12.230350     NaN
2 2020-05-08    30.934300  12.230350   rainy
3 2020-05-09    26.109725   6.889682  cloudy
4 2020-05-10    13.908200  19.012990   rainy
5 2020-05-11    23.938200  12.230350   sunny

In [21]:
data.fillna(data.median())

        date  temperature  windSpeed  status
0 2020-05-06     35.65820  10.788378   sunny
1 2020-05-07     27.43625  10.788378     NaN
2 2020-05-08     30.93430  10.788378   rainy
3 2020-05-09     27.43625   6.889682  cloudy
4 2020-05-10     13.90820  19.012990   rainy
5 2020-05-11     23.93820  10.788378   sunny

## filling for specific range

In [20]:
data.fillna(data.mean()['temperature':'windSpeed'])

        date  temperature  windSpeed  status
0 2020-05-06    35.658200  10.788378   sunny
1 2020-05-07    26.109725  12.230350     NaN
2 2020-05-08    30.934300  12.230350   rainy
3 2020-05-09    26.109725   6.889682  cloudy
4 2020-05-10    13.908200  19.012990   rainy
5 2020-05-11    23.938200  12.230350   sunny

## interpolation

In [24]:
data.temperature.interpolate()

0    35.65820
1    33.29625
2    30.93430
3    22.42125
4    13.90820
5    23.93820
Name: temperature, dtype: float64

In [35]:
data.temperature.interpolate()

0    35.65820
1    33.29625
2    30.93430
3    22.42125
4    13.90820
5    23.93820
Name: temperature, dtype: float64

In [36]:
data.temperature.interpolate(method='barycentric')

0    35.65820
1    39.46530
2    30.93430
3    19.32775
4    13.90820
5    23.93820
Name: temperature, dtype: float64

In [37]:
data.temperature.interpolate(method='pchip')

0    35.658200
1    34.220728
2    30.934300
3    21.496772
4    13.908200
5    23.938200
Name: temperature, dtype: float64

In [32]:
data.temperature.interpolate(method='akima')

0    35.658200
1    34.448184
2    30.934300
3    22.421250
4    13.908200
5    23.938200
Name: temperature, dtype: float64

In [38]:
data.temperature.interpolate(method='polynomial',order=2)

0    35.658200
1    36.196165
2    30.934300
3    19.872606
4    13.908200
5    23.938200
Name: temperature, dtype: float64

In [34]:
data.temperature.interpolate(method='spline',order=2)

0    35.658200
1    35.076089
2    30.934300
3    20.526966
4    13.908200
5    23.938200
Name: temperature, dtype: float64

In [39]:
data.windSpeed.interpolate(method='barycentric',order=2)

0    10.788378
1     2.777376
2     1.477811
3     6.889682
4    19.012990
5    37.847735
Name: windSpeed, dtype: float64

In [40]:
data.windSpeed.interpolate(method='pchip')

0    10.788378
1     8.044851
2     7.034078
3     6.889682
4    19.012990
5    20.312555
Name: windSpeed, dtype: float64

In [42]:
data.windSpeed.interpolate(method='akima')

0    10.788378
1     5.014522
2     3.714956
3     6.889682
4    19.012990
5          NaN
Name: windSpeed, dtype: float64

In [44]:
data.windSpeed.interpolate(method='spline',order=2)

0    10.788378
1     2.777376
2     1.477811
3     6.889682
4    19.012990
5    37.847735
Name: windSpeed, dtype: float64

In [45]:
data.windSpeed.interpolate(method='polynomial',order=2)

0    10.788378
1     2.777376
2     1.477811
3     6.889682
4    19.012990
5          NaN
Name: windSpeed, dtype: float64